namespace MiniPdm.Domain.Enums;

/// <summary>
/// Тип объекта PDM-системы.
/// </summary>
public enum ItemType
{
    /// <summary>
    /// Сборочная единица (имеет обозначение по ЕСКД, состав, масса вычисляется).
    /// </summary>
    Assembly = 1,

    /// <summary>
    /// Деталь (имеет обозначение по ЕСКД, материал, массу за 1 шт).
    /// </summary>
    Part = 2,

    /// <summary>
    /// Стандартное изделие (болт, подшипник и т.д. Обозначения нет, уникально по наименованию, имеет массу за 1 шт).
    /// </summary>
    StandardPart = 3
}

